khpeng/academic_project/Fall_Down_STM32/STM32/lab11/main.c
//Shengwei Peng, Yifan Liu
#include <stm32f30x.h>  // Pull in include files for F30x standard drivers 
#include <f3d_led.h>     // Pull in include file for the local drivers
#include <f3d_uart.h>
#include <f3d_gyro.h>
#include <f3d_lcd_sd.h>
#include <f3d_i2c.h>
#include <f3d_accel.h>
#include <f3d_mag.h>
#include <f3d_nunchuk.h>
#include <f3d_rtc.h>
#include <f3d_systick.h>
#include <ff.h>
#include <diskio.h>
#include <math.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#define TIMER 20000
#define AUDIOBUFSIZE 128

extern uint8_t Audiobuf[AUDIOBUFSIZE];
extern int audioplayerHalf;
extern int audioplayerWhole;

FATFS Fatfs;		/* File system object */
FIL fid;		/* File object */
BYTE Buff[512];		/* File read buffer */
int ret;
nunchuk_t nundata;

struct ckhd {
  uint32_t ckID;
  uint32_t cksize;
};

struct fmtck {
  uint16_t wFormatTag;      
  uint16_t nChannels;
  uint32_t nSamplesPerSec;
  uint32_t nAvgBytesPerSec;
  uint16_t nBlockAlign;
  uint16_t wBitsPerSample;
};

void readckhd(FIL *fid, struct ckhd *hd, uint32_t ckID) {
  f_read(fid, hd, sizeof(struct ckhd), &ret);
  if (ret != sizeof(struct ckhd))
    exit(-1);
  if (ckID && (ckID != hd->ckID))
    exit(-1);
}

void die (FRESULT rc) {
  printf("Failed with rc=%u.\n", rc);
  while (1);
}
/*
void init() {
  setvbuf(stdin, NULL, _IONBF, 0);
  setvbuf(stdout, NULL, _IONBF, 0);
  setvbuf(stderr, NULL, _IONBF, 0);

  f3d_uart_init();
  f3d_timer2_init();
  f3d_dac_init();
  f3d_delay_init();
  f3d_rtc_init();
  f3d_systick_init();
  f3d_lcd_init();
  f3d_i2c1_init();
  printf("before nun");
  f3d_nunchuk_init();
  printf("after nun");
  f3d_lcd_fillScreen(RED);
}

*/
int playMusic(char filename[]){
  FRESULT rc;			/* Result code */

  f_mount(0, &Fatfs);/* Register volume work area */
  printf("\nOpen file\n");
  printf("\nOpen %s\n", filename);
  rc = f_open(&fid, filename, FA_READ);

  if (!rc) {
    struct ckhd hd;
    uint32_t  waveid;
    struct fmtck fck;
    
    // readckhd
    readckhd(&fid, &hd, 'FFIR');
    
    f_read(&fid, &waveid, sizeof(waveid), &ret);
    if ((ret != sizeof(waveid)) || (waveid != 'EVAW'))
      return -1;
		 
    
    readckhd(&fid, &hd, ' tmf');
    
    f_read(&fid, &fck, sizeof(fck), &ret);
    
    // skip over extra info
    
    if (hd.cksize != 16) {
      printf("extra header info %d\n", hd.cksize - 16);
      f_lseek(&fid, hd.cksize - 16);
    }
    
    printf("audio format 0x%x\n", fck.wFormatTag);
    printf("channels %d\n", fck.nChannels);
    printf("sample rate %d\n", fck.nSamplesPerSec);
    printf("data rate %d\n", fck.nAvgBytesPerSec);
    printf("block alignment %d\n", fck.nBlockAlign);
    printf("bits per sample %d\n", fck.wBitsPerSample);
    
    // now skip all non-data chunks !
    
    while(1){
      readckhd(&fid, &hd, 0);
      if (hd.ckID == 'atad')
	break;
      f_lseek(&fid, hd.cksize);
    }
    
   printf("Samples %d\n", hd.cksize);
    
    // Play it !
    
    //audioplayerInit(fck.nSamplesPerSec);
    
    f_read(&fid, Audiobuf, AUDIOBUFSIZE, &ret);
    hd.cksize -= ret;
    audioplayerStart();
    printf("fuck");
    delay(10);
    while (hd.cksize) {
      int next = hd.cksize > AUDIOBUFSIZE/2 ? AUDIOBUFSIZE/2 : hd.cksize;
      if (audioplayerHalf) {
	if (next < AUDIOBUFSIZE/2)
	  bzero(Audiobuf, AUDIOBUFSIZE/2);
	f_read(&fid, Audiobuf, next, &ret);
	hd.cksize -= ret;
	audioplayerHalf = 0;
      }
      if (audioplayerWhole) {
	if (next < AUDIOBUFSIZE/2)
	  bzero(&Audiobuf[AUDIOBUFSIZE/2], AUDIOBUFSIZE/2);
	f_read(&fid, &Audiobuf[AUDIOBUFSIZE/2], next, &ret);
	hd.cksize -= ret;
	audioplayerWhole = 0;
      }
    }
    audioplayerStop();
  }
  
  printf("\nClose the file.\n"); 
  rc = f_close(&fid);
  
  if (rc) die(rc);

}


int main(void) { 

  FRESULT rc;			/* Result code */
  DIR dir;			/* Directory object */
  FILINFO fno;			/* File information object */
  UINT bw, br;
  unsigned int retval;
  int bytesread;
  char *name[] = {"thermo.wav","start.wav","ammas.wav"};
  int button;
  // init();
  setvbuf(stdin, NULL, _IONBF, 0);
  setvbuf(stdout, NULL, _IONBF, 0);
  setvbuf(stderr, NULL, _IONBF, 0);

  f3d_uart_init();
  f3d_timer2_init();
  f3d_dac_init();
  f3d_delay_init();
  f3d_rtc_init();
  f3d_systick_init();
  f3d_lcd_init();
  f3d_i2c1_init();
  printf("before nun");
  f3d_nunchuk_init();
  printf("after nun");
  f3d_lcd_fillScreen(RED);
  //while loop
  printf("done");


  while(1) {
   f3d_nunchuk_read(&nundata);
   button = button % 3;
   if (button == 0){
     
     f3d_lcd_drawString(65, 20, name[0], GREEN, BLACK );
     f3d_lcd_drawString(65, 40, name[1], GREEN, BLACK );
     f3d_lcd_drawString(65, 60, name[2], GREEN, BLACK );
     f3d_lcd_drawString(5, 20, "Selected->", GREEN, BLACK );
     playMusic(name[0]);
     printf("switch to file 0");
   } 
   if (button == 1){
     f3d_lcd_drawString(65, 20, name[0], GREEN, BLACK );
     f3d_lcd_drawString(65, 40, name[1], GREEN, BLACK );
     f3d_lcd_drawString(65, 60, name[2], GREEN, BLACK );
     f3d_lcd_drawString(5, 40, "Selected->", GREEN, BLACK );
     playMusic(name[1]);
     printf("switch to file 1");
   }
   if (button == 2) {
     f3d_lcd_drawString(65, 20, name[0], GREEN, BLACK );
     f3d_lcd_drawString(65, 40, name[1], GREEN, BLACK );
     f3d_lcd_drawString(65, 60, name[2], GREEN, BLACK );
     f3d_lcd_drawString(5, 60, "Selected->", GREEN, BLACK );
     playMusic(name[2]);
     printf("switch to file 2");
   }
   if ((nundata.z == 1) || (nundata.jx == 255)) {
     button++;
     f3d_lcd_fillScreen(RED);
   }
   if ((nundata.c == 1) || (nundata.jx == 0)) {
     button--;
     f3d_lcd_fillScreen(RED);
     f3d_led_all_off();
     if (button < 0) button += 3;       // Check for negative button value
   }	
  }
}

#ifdef USE_FULL_ASSERT
void assert_failed(uint8_t* file, uint32_t line) {
  /* Infinite loop */
  /* Use GDB to find out why we're here */
  while (1);
}
#endif


/* main.c ends here */
